{
	"settings": {
		"title": "Setting up Telegram bot",
		"already_registered_own_bot": "Your Homey is already registered with your own custom bot on Telegram.",
		"own_bot": "Set up your own bot",
		"own_bot_description": "It is required to set up your own Telegram bot. It is not hard, but it is a little bit more work. However, this makes communication fully secure: if  you use the @athomhomey_bot it is theoretically possible that we read the communication on the bot.<br/>By setting up your own bot, this is not possible.<br/><br/><b>To set up your own bot, follow these steps:</b>",
		"step1": "1. Open a chat with <a href='https://telegram.me/botfather' target='_blank'>Botfather</a> using the Telegram app.",
		"step2": "2. Create a new bot with /newbot. It will ask for a name and a username (must end with .....bot).",
		"step3": "3. When created a <i>token</i> is given to you. Copy the token, save it to the field below.",
		"step4": "4. Set your privacy settings with /setprivacy (is default on enabled, which is ok, but just to be sure....)",
		"step5": "5. When a private bot is made in Telegram, the bot can be added to groups by default. To change this send '/setjoingroups' in the chat with BotFather and set it to 'Disable', or leave it enabled if you want to be able to add the bot to a group chat.",
		"step6": "6. Use the button below to save this. Homey will connect to the Telegram bot and set a 'webhook' so Homey will be called when the Telegram bot receives a message.",
		"step7": "7. Send the register command to your Homey bot: <input class='device_id homey-form-input' type='text' value='/register 12345'><button class='copy_text homey-button-secondary-shadow'>Copy</button><br/><br/>",
		"step8": "8. Send a message 'ping' to the bot. If all is well, you will receive a message 'pong' from Homey!",
		"token": "Token",
		"save": "Save",
		"success": "Successfully setup your bot for Homey!",
		"delete_bot": "Delete the bot settings",
		"connected_users": "Connected users/groups",
		"delete": "Delete",
		"are_you_sure": "Are you sure you wish to disconnect this user/group?",
		"are_you_sure_bot": "Are you sure you wish to disconnect this bot?",
		"renew_webhook": "Renew Webhook registration",
		"refresh_log": "Refresh log",
		"copy": "Copy",
		"reload": "Reload"
	},
	"unregistered": "Unregistered succesfully",
	"registered": "Homey registered to Telegram chat succesfully",
	"help": "Helptext coming soon",
	"group": "Group",
	"already_registered": "This chat is already registered to Homey"
}