{
	"settings": {
		"title": "Instellen van uw Telegram bot",
		"info": "Om Homey met uw Telegram user ID te registreren, stuurt u het bericht hieronder naar de <a href='http://telegram.me/athomhomey_bot' target='_blank'>@athomhomey_bot</a> op Telegram:",
		"already_registered": "Uw Homey is reeds geregistreerd met de <a href='http://telegram.me/athomhomey_bot' target='_blank'>@athomhomey_bot</a> op Telegram. Om deze los te koppelen, stuurt u het volgende bericht naar de bot op Telegram:",
		"already_registered_own_bot": "Uw Homey is reeds geregistreerd met uw eigen bot op Telegram. Om deze los te koppelen, stuurt u het volgende bericht naar de bot op Telegram:",
		"own_bot": "Eigen bot opzetten (optioneel)",
		"own_bot_description": "Het is mogelijk om uw eigen Telegram bot op te zetten. Dit is niet lastig, maar wel iets meer werk. Het maakt de communicatie volledig veilig: Als u de @athomhomey_bot gebruikt is het theoretisch mogelijk dat wij de communicatie met de bot lezen.<br/>Door uw eigen bot op te zetten is dit niet mogelijk.<br/><br/><b>Om uw eigen bot op te zetten volgt u deze stappen:</b>",
		"step1": "1. Open een chat met <a href='https://telegram.me/botfather' target='_blank'>Botfather</a> met de Telegram app.",
		"step2": "2. Maak een nieuwe bot met het commando /newbot. Botfather zal vragen om een naam en een username (moet eindigen op .....bot).",
		"step3": "3. Na het aanmaken ontvangt u een <i>token</i>. Kopieer de token naar het veld hieronder.",
		"step4": "4. Stel de privacy in met /setprivacy (staat standaard goed, maar kan geen kwaad om extra na te kijken)",
		"step5": "5. Als je een prive bot hebt gemaakt in Telegram, kan de bot standaard toegevoegd worden aan groepen. Om dit uit te schakelen stuur je '/setjoingroups' naar BotFather, selecteer de privebot en zet het op 'Disable'",
		"step6": "6. Gebruik de knop hieronder om het op te slaan. Homey zal een connectie maken naar de Telegram bot en een 'webhook' instellen zodat Telegram berichten doorgeeft aan Homey.",
		"step7": "7. Stuur het registreer-commando naar de Homey bot: <input class='device_id' value='/register 12345'>",
		"step8": "8. Stuur een bericht 'ping' naar de bot. Als alles goed is gegaan, ontvangt u een bericht 'pong' van Homey op Telegram!",
		"step9": "9. Geniet van deze app! <a href='http://www.d2c.nl' target='_blank'>En als u mij wenst te bedanken voor de ontwikkeling kunt u hier klikken om een biertje voor mij te kopen</a> (Volledig vrijwillig, maar wordt wel zeer gewaardeerd!).",
		"token": "Token",
		"save": "Opslaan",
		"success": "Instellen van de bot voor Homey is succesvol verlopen!",
		"delete_bot": "Verwijder de eigen bot instellingen"
	},
	"unregistered": "Loskoppelen is gelukt",
	"registered": "Homey is succesvol aan de Telegram chat gekoppeld",
	"help": "Helptekst komt binnenkort!"
}